--- dataKeyboardKeys

local dataKeyboardKeys = {
    [48] = "0",
    [49] = "1",
    [50] = "2",
    [51] = "3",
    [52] = "4",
    [53] = "5",
    [54] = "6",
    [55] = "7",
    [56] = "8",
    [57] = "9",
    [65] = "A",
    [66] = "B",
    [67] = "C",
    [68] = "D",
    [69] = "E",
    [70] = "F",
    [71] = "G",
    [72] = "H",
    [73] = "I",
    [74] = "J",
    [75] = "K",
    [76] = "L",
    [77] = "M",
    [78] = "N",
    [79] = "O",
    [80] = "P",
    [81] = "Q",
    [82] = "R",
    [83] = "S",
    [84] = "T",
    [85] = "U",
    [86] = "V",
    [87] = "W",
    [88] = "X",
    [89] = "Y",
    [90] = "Z",

    -- On NumPad
    [96] = "NumPad 0",
    [97] = "NumPad 1",
    [98] = "NumPad 2",
    [99] = "NumPad 3",
    [100] = "NumPad 4",
    [101] = "NumPad 5",
    [102] = "NumPad 6",
    [103] = "NumPad 7",
    [104] = "NumPad 8",
    [105] = "NumPad 9",
    [106] = "NumPad *",
    [110] = "NumPad .",
    --[107] = "NumPad +", -- не посылают код
    --[109] = "NumPad -", -- не посылают код
    --[111] = "NumPad /",	-- в выключенном состоянии для этой клавиши кода нет

    -- Off NumPad
    [144] = "NumLock",
    [35] = "NumPad 1",
    [40] = "NumPad 2",
    [34] = "NumPad 3",
    [37] = "NumPad 4",
    [12] = "NumPad 5",
    [39] = "NumPad 6",
    [36] = "NumPad 7",
    [38] = "NumPad 8",
    [33] = "NumPad 9",
    [106] = "NumPad *",
    [46] = "NumPad .", -- [46] = "Delete"
    --[107] = "NumPad +", -- не посылают код
    --[109] = "NumPad -", -- не посылают код
    --[111] = "NumPad /", -- нет кода при выключенном NumLock (поэтому лучше не использовать)


    [145] = "ScrollLock",
    [19] = "PauseBreak",
    [157] = "Meta",
    [186] = ";",
    [187] = "=",
    [188] = ",",
    [189] = "-",
    [190] = ".",
    [191] = "/",
    [192] = "~",
    [219] = "[",
    [220] = "\\", -- \
    [221] = "]",
    [222] = "'",

    [32] = "Space", -- пробел (задаётся кодом 32)

    [17] = "Ctrl",
    [16] = "Shift",

    [27] = "Esc",
}

return dataKeyboardKeys
