--- Параметры цвета

local dataColors = {

    -- красный
    red1 = RGB(255, 199, 206),
    red2 = RGB(255, 104, 96),
    red3 = RGB(156, 0, 6),

    -- желтый
    yellow1 = RGB(255, 235, 156),
    yellow2 = RGB(156, 101, 0),

    -- зелёный
    green1 = RGB(198, 239, 206),
    green2 = RGB(137, 218, 88),
    green3 = RGB(0, 97, 0),

    -- синий
    blue1 = RGB(192, 224, 255),
    blue2 = RGB(0, 128, 255),

    -- серый
    gray1 = RGB(235, 235, 235),
    gray2 = RGB(185, 185, 185),
    gray3 = RGB(90, 90, 90),
    gray4 = RGB(230, 230, 230),


    -- чёрный
    black = RGB(0, 0, 0),

    -- белый
    white = RGB(255, 255, 255),

    -- blue
    blue_1 = RGB(207, 226, 255), -- текст чёрный
    blue_2 = RGB(158, 197, 254), -- текст чёрный
    blue_3 = RGB(110, 168, 254), -- текст чёрный
    blue_4 = RGB(61, 139, 253), -- текст чёрный
    blue_5 = RGB(13, 110, 253), -- текст белый
    blue_6 = RGB(10, 88, 202), -- текст белый
    blue_7 = RGB(8, 66, 152), -- текст белый
    blue_8 = RGB(5, 44, 101), -- текст белый
    blue_9 = RGB(3, 22, 51), -- текст белый

    -- indigo
    indigo_1 = RGB(224, 207, 252), -- текст чёрный
    indigo_2 = RGB(194, 159, 250), -- текст чёрный
    indigo_3 = RGB(163, 112, 247), -- текст чёрный
    indigo_4 = RGB(133, 64, 245), -- текст белый
    indigo_5 = RGB(102, 16, 242), -- текст белый
    indigo_6 = RGB(82, 13, 194), -- текст белый
    indigo_7 = RGB(61, 10, 145), -- текст белый
    indigo_8 = RGB(41, 6, 97), -- текст белый
    indigo_9 = RGB(20, 3, 48), -- текст белый

    -- purple
    purple_1 = RGB(226, 217, 243), -- текст чёрный
    purple_2 = RGB(197, 179, 230), -- текст чёрный
    purple_3 = RGB(169, 142, 218), -- текст чёрный
    purple_4 = RGB(140, 104, 205), -- текст чёрный
    purple_5 = RGB(111, 66, 193), -- текст белый
    purple_6 = RGB(89, 53, 154), -- текст белый
    purple_7 = RGB(67, 40, 116), -- текст белый
    purple_8 = RGB(44, 26, 77), -- текст белый
    purple_9 = RGB(22, 13, 39), -- текст белый

    -- pink
    pink_1 = RGB(247, 214, 230), -- текст чёрный
    pink_2 = RGB(239, 173, 206), -- текст чёрный
    pink_3 = RGB(230, 133, 181), -- текст чёрный
    pink_4 = RGB(222, 92, 157), -- текст чёрный
    pink_5 = RGB(214, 51, 132), -- текст белый
    pink_6 = RGB(171, 41, 106), -- текст белый
    pink_7 = RGB(128, 31, 79), -- текст белый
    pink_8 = RGB(86, 20, 53), -- текст белый
    pink_9 = RGB(43, 10, 26), -- текст белый

    -- red
    red_1 = RGB(248, 215, 218), -- текст чёрный
    red_2 = RGB(241, 174, 181), -- текст чёрный
    red_3 = RGB(234, 134, 143), -- текст чёрный
    red_4 = RGB(227, 93, 106), -- текст чёрный
    red_5 = RGB(220, 53, 69), -- текст белый
    red_6 = RGB(176, 42, 55), -- текст белый
    red_7 = RGB(132, 32, 41), -- текст белый
    red_8 = RGB(88, 21, 28), -- текст белый
    red_9 = RGB(44, 11, 14), -- текст белый

    -- orange
    orange_1 = RGB(255, 229, 208), -- текст чёрный
    orange_2 = RGB(254, 203, 161), -- текст чёрный
    orange_3 = RGB(254, 178, 114), -- текст чёрный
    orange_4 = RGB(253, 152, 67), -- текст чёрный
    orange_5 = RGB(253, 126, 20), -- текст чёрный
    orange_6 = RGB(202, 101, 16), -- текст чёрный
    orange_7 = RGB(152, 76, 12), -- текст белый
    orange_8 = RGB(101, 50, 8), -- текст белый
    orange_9 = RGB(51, 25, 4), -- текст белый

    -- yellow
    yellow_1 = RGB(255, 243, 205), -- текст чёрный
    yellow_2 = RGB(255, 230, 156), -- текст чёрный
    yellow_3 = RGB(255, 218, 106), -- текст чёрный
    yellow_4 = RGB(255, 205, 57), -- текст чёрный
    yellow_5 = RGB(255, 193, 7), -- текст чёрный
    yellow_6 = RGB(204, 154, 6), -- текст чёрный
    yellow_7 = RGB(153, 116, 4), -- текст чёрный
    yellow_8 = RGB(102, 77, 3), -- текст белый
    yellow_9 = RGB(51, 39, 1), -- текст белый

    -- green
    green_1 = RGB(209, 231, 221), -- текст чёрный
    green_2 = RGB(163, 207, 187), -- текст чёрный
    green_3 = RGB(117, 183, 152), -- текст чёрный
    green_4 = RGB(71, 159, 118), -- текст чёрный
    green_5 = RGB(25, 135, 84), -- текст белый
    green_6 = RGB(20, 108, 67), -- текст белый
    green_7 = RGB(15, 81, 50), -- текст белый
    green_8 = RGB(10, 54, 34), -- текст белый
    green_9 = RGB(5, 27, 17), -- текст белый

    -- teal
    teal_1 = RGB(210, 244, 234), -- текст чёрный
    teal_2 = RGB(166, 233, 213), -- текст чёрный
    teal_3 = RGB(121, 223, 193), -- текст чёрный
    teal_4 = RGB(77, 212, 172), -- текст чёрный
    teal_5 = RGB(32, 201, 151), -- текст чёрный
    teal_6 = RGB(26, 161, 121), -- текст чёрный
    teal_7 = RGB(19, 121, 91), -- текст белый
    teal_8 = RGB(13, 80, 60), -- текст белый
    teal_9 = RGB(6, 40, 30), -- текст белый

    -- cyan
    cyan_1 = RGB(207, 244, 252), -- текст чёрный
    cyan_2 = RGB(158, 234, 249), -- текст чёрный
    cyan_3 = RGB(110, 223, 246), -- текст чёрный
    cyan_4 = RGB(61, 213, 243), -- текст чёрный
    cyan_5 = RGB(13, 202, 240), -- текст чёрный
    cyan_6 = RGB(10, 162, 192), -- текст чёрный
    cyan_7 = RGB(8, 121, 144), -- текст белый
    cyan_8 = RGB(5, 81, 96), -- текст белый
    cyan_9 = RGB(3, 40, 48), -- текст белый

    -- gray
    gray_1 = RGB(248, 249, 250), -- текст чёрный
    gray_2 = RGB(233, 236, 239), -- текст чёрный
    gray_3 = RGB(222, 226, 230), -- текст чёрный
    gray_4 = RGB(206, 212, 218), -- текст чёрный
    gray_5 = RGB(173, 181, 189), -- текст чёрный
    gray_6 = RGB(108, 117, 125), -- текст белый
    gray_7 = RGB(73, 80, 87), -- текст белый
    gray_8 = RGB(52, 58, 64), -- текст белый
    gray_9 = RGB(33, 37, 41), -- текст белый

    -- blue
    blue_1_ = RGB(207, 226, 255), -- текст чёрный
    blue_2_ = RGB(158, 197, 254), -- текст чёрный
    blue_3_ = RGB(110, 168, 254), -- текст чёрный
    blue_4_ = RGB(61, 139, 253), -- текст чёрный
    blue_5_ = RGB(13, 110, 253), -- текст белый
    blue_6_ = RGB(10, 88, 202), -- текст белый
    blue_7_ = RGB(8, 66, 152), -- текст белый
    blue_8_ = RGB(5, 44, 101), -- текст белый
    blue_9_ = RGB(3, 22, 51), -- текст белый

    -- indigo
    indigo_1_ = RGB(224, 207, 252), -- текст чёрный
    indigo_2_ = RGB(194, 159, 250), -- текст чёрный
    indigo_3_ = RGB(163, 112, 247), -- текст чёрный
    indigo_4_ = RGB(133, 64, 245), -- текст белый
    indigo_5_ = RGB(102, 16, 242), -- текст белый
    indigo_6_ = RGB(82, 13, 194), -- текст белый
    indigo_7_ = RGB(61, 10, 145), -- текст белый
    indigo_8_ = RGB(41, 6, 97), -- текст белый
    indigo_9_ = RGB(20, 3, 48), -- текст белый

    -- purple
    purple_1_ = RGB(226, 217, 243), -- текст чёрный
    purple_2_ = RGB(197, 179, 230), -- текст чёрный
    purple_3_ = RGB(169, 142, 218), -- текст чёрный
    purple_4_ = RGB(140, 104, 205), -- текст чёрный
    purple_5_ = RGB(111, 66, 193), -- текст белый
    purple_6_ = RGB(89, 53, 154), -- текст белый
    purple_7_ = RGB(67, 40, 116), -- текст белый
    purple_8_ = RGB(44, 26, 77), -- текст белый
    purple_9_ = RGB(22, 13, 39), -- текст белый

    -- pink
    pink_1_ = RGB(247, 214, 230), -- текст чёрный
    pink_2_ = RGB(239, 173, 206), -- текст чёрный
    pink_3_ = RGB(230, 133, 181), -- текст чёрный
    pink_4_ = RGB(222, 92, 157), -- текст чёрный
    pink_5_ = RGB(214, 51, 132), -- текст белый
    pink_6_ = RGB(171, 41, 106), -- текст белый
    pink_7_ = RGB(128, 31, 79), -- текст белый
    pink_8_ = RGB(86, 20, 53), -- текст белый
    pink_9_ = RGB(43, 10, 26), -- текст белый

    -- red
    red_1_ = RGB(248, 215, 218), -- текст чёрный
    red_2_ = RGB(241, 174, 181), -- текст чёрный
    red_3_ = RGB(234, 134, 143), -- текст чёрный
    red_4_ = RGB(227, 93, 106), -- текст чёрный
    red_5_ = RGB(220, 53, 69), -- текст белый
    red_6_ = RGB(176, 42, 55), -- текст белый
    red_7_ = RGB(132, 32, 41), -- текст белый
    red_8_ = RGB(88, 21, 28), -- текст белый
    red_9_ = RGB(44, 11, 14), -- текст белый

    -- orange
    orange_1_ = RGB(255, 229, 208), -- текст чёрный
    orange_2_ = RGB(254, 203, 161), -- текст чёрный
    orange_3_ = RGB(254, 178, 114), -- текст чёрный
    orange_4_ = RGB(253, 152, 67), -- текст чёрный
    orange_5_ = RGB(253, 126, 20), -- текст чёрный
    orange_6_ = RGB(202, 101, 16), -- текст чёрный
    orange_7_ = RGB(152, 76, 12), -- текст белый
    orange_8_ = RGB(101, 50, 8), -- текст белый
    orange_9_ = RGB(51, 25, 4), -- текст белый

    -- yellow
    yellow_1_ = RGB(255, 243, 205), -- текст чёрный
    yellow_2_ = RGB(255, 230, 156), -- текст чёрный
    yellow_3_ = RGB(255, 218, 106), -- текст чёрный
    yellow_4_ = RGB(255, 205, 57), -- текст чёрный
    yellow_5_ = RGB(255, 193, 7), -- текст чёрный
    yellow_6_ = RGB(204, 154, 6), -- текст чёрный
    yellow_7_ = RGB(153, 116, 4), -- текст чёрный
    yellow_8_ = RGB(102, 77, 3), -- текст белый
    yellow_9_ = RGB(51, 39, 1), -- текст белый

    -- green
    green_1_ = RGB(209, 231, 221), -- текст чёрный
    green_2_ = RGB(163, 207, 187), -- текст чёрный
    green_3_ = RGB(117, 183, 152), -- текст чёрный
    green_4_ = RGB(71, 159, 118), -- текст чёрный
    green_5_ = RGB(25, 135, 84), -- текст белый
    green_6_ = RGB(20, 108, 67), -- текст белый
    green_7_ = RGB(15, 81, 50), -- текст белый
    green_8_ = RGB(10, 54, 34), -- текст белый
    green_9_ = RGB(5, 27, 17), -- текст белый

    -- teal
    teal_1_ = RGB(210, 244, 234), -- текст чёрный
    teal_2_ = RGB(166, 233, 213), -- текст чёрный
    teal_3_ = RGB(121, 223, 193), -- текст чёрный
    teal_4_ = RGB(77, 212, 172), -- текст чёрный
    teal_5_ = RGB(32, 201, 151), -- текст чёрный
    teal_6_ = RGB(26, 161, 121), -- текст чёрный
    teal_7_ = RGB(19, 121, 91), -- текст белый
    teal_8_ = RGB(13, 80, 60), -- текст белый
    teal_9_ = RGB(6, 40, 30), -- текст белый

    -- cyan
    cyan_1_ = RGB(207, 244, 252), -- текст чёрный
    cyan_2_ = RGB(158, 234, 249), -- текст чёрный
    cyan_3_ = RGB(110, 2233, 246), -- текст чёрный
    cyan_4_ = RGB(61, 213, 243), -- текст чёрный
    cyan_5_ = RGB(13, 202, 240), -- текст чёрный
    cyan_6_ = RGB(10, 162, 192), -- текст чёрный
    cyan_7_ = RGB(8, 121, 144), -- текст белый
    cyan_8_ = RGB(5, 81, 96), -- текст белый
    cyan_9_ = RGB(3, 40, 48), -- текст белый

    -- gray
    gray_1_ = RGB(248, 249, 250), -- текст чёрный
    gray_2_ = RGB(233, 236, 239), -- текст чёрный
    gray_3_ = RGB(222, 226, 230), -- текст чёрный
    gray_4_ = RGB(206, 212, 218), -- текст чёрный
    gray_5_ = RGB(173, 181, 189), -- текст чёрный
    gray_6_ = RGB(108, 117, 125), -- текст белый
    gray_7_ = RGB(73, 80, 87), -- текст белый
    gray_8_ = RGB(52, 58, 64), -- текст белый
    gray_9_ = RGB(33, 37, 41), -- текст белый
}

return dataColors;
